РасширениеГТС/Джитиис/Documents/ЗаказНаПеремещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаПеремещение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ASP_ЗаказКлиента</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

РасширениеГТС/Джитиис/Documents/ЗаказНаПеремещение/Ext/ObjectModule.bsl
&ИзменениеИКонтроль("ОбработкаПроведения")
Процедура асп_ОбработкаПроведения(Отказ, РежимПроведения)
    #Вставка
	Если СтрНайти(Строка(СкладПолучатель), "Объект не найден") > 0 Тогда //Отказ = Истина; 
		Попытка
			ЗаписьЖурналаРегистрации("Проверка склада по заказу на перемещение", УровеньЖурналаРегистрации.Примечание,,"Ошибка с битой ссылкой" + Символы.ПС + ЭтотОбъект.СкладПолучатель +
			Символы.ПС + ЭтотОбъект.Товары[0].ASP_ЗаказКлиента + Символы.ПС + ЭтотОбъект.Товары[0].Номенклатура + Символы.ПС + ЭтотОбъект.Товары[0].Количество +Символы.ПС + ЭтотОбъект.Товары[0].КоличествоУпаковок +"", "Ошибка с битой ссылкой");	
		Исключение
			ЗаписьЖурналаРегистрации("Проверка склада по заказу на перемещение", УровеньЖурналаРегистрации.Примечание,,"Ошибка с битой ссылкой" + Символы.ПС + ЭтотОбъект.СкладПолучатель + "", "Ошибка с битой ссылкой");	
		КонецПопытки;
	КонецЕсли;
	#КонецВставки
	
	ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
	ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ);
	
	//++ASP_Crow 11.03.2026 000029567 в расширение 
	ДоставкаТоваров.ОтразитьСостояниеДоставки(Ссылка, Отказ);  
	Если Отказ Тогда
		ЗаписьЖурналаРегистрации("Проверка отказа перемещения", УровеньЖурналаРегистрации.Примечание,,,"Отказ после ДоставкаТоваров");  
	КонецЕсли;
	//ASP_Hlopkov 10.09.2020+ Добавил условие
	Если НЕ ДополнительныеСвойства.Свойство("БезКонтроляОстатков") Тогда
		ВыполнитьКонтрольЗаказаПослеПроведения(Отказ);
	КонецЕсли;
	Если Отказ Тогда
		ЗаписьЖурналаРегистрации("Проверка отказа перемещения", УровеньЖурналаРегистрации.Примечание,,,"Отказ после ВыполнитьКонтрольЗаказаПослеПроведения");  
	КонецЕсли;     
	//--ASP_Crow 11.03.2026 000029567 в расширение
	
	ВыполнитьКонтрольЗаказаПослеПроведения(Отказ);
	
	ЗаказНаПеремещениеЛокализация.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения);
	
КонецПроцедуры
